Compiler/o/lex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Lex使用</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Lex使用"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-11 02:16:17 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">Lex使用</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<p>
Manual: <a href="http://flex.sourceforge.net/manual">http://flex.sourceforge.net/manual</a><br/>
</p>
<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 基本格式</a>
<ul>
<li><a href="#sec-1-1">1.1 正则定义</a></li>
<li><a href="#sec-1-2">1.2 转换规则</a></li>
</ul>
</li>
<li><a href="#sec-2">2 开始状态(start sate)</a></li>
<li><a href="#sec-3">3 EOF</a></li>
<li><a href="#sec-4">4 输入管理</a></li>
<li><a href="#sec-5">5 option</a>
<ul>
<li><a href="#sec-5-1">5.1 nodefault</a></li>
<li><a href="#sec-5-2">5.2 yylineo</a></li>
<li><a href="#sec-5-3">5.3 noyywrap</a></li>
<li><a href="#sec-5-4">5.4 case-insensitive</a></li>
</ul>
</li>
<li><a href="#sec-6">6 内置变量和函数</a>
<ul>
<li><a href="#sec-6-1">6.1 变量</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 yytext</a></li>
<li><a href="#sec-6-1-2">6.1.2 yyleng</a></li>
<li><a href="#sec-6-1-3">6.1.3 yyin</a></li>
<li><a href="#sec-6-1-4">6.1.4 yyout</a></li>
<li><a href="#sec-6-1-5">6.1.5 yylineo</a></li>
<li><a href="#sec-6-1-6">6.1.6 ECHO</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 函数</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 yylex</a></li>
<li><a href="#sec-6-2-2">6.2.2 yywrap</a></li>
<li><a href="#sec-6-2-3">6.2.3 yymore</a></li>
<li><a href="#sec-6-2-4">6.2.4 yyless</a></li>
<li><a href="#sec-6-2-5">6.2.5 yyrestart</a></li>
<li><a href="#sec-6-2-6">6.2.6 REJECT</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 编译</a></li>
<li><a href="#sec-8">8 例子</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本格式</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">%{
这里的代码会原封不动地移到lex编译后的lex.yy.c中
%}
正则定义
%%
转换规则
%%
辅助函数
</pre>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 正则定义</h3>
<div class="outline-text-3" id="text-1-1">

<p>   形如：letter [a-zA-z]，要使用正则定义符号则要在符号外加{}，例如：fuword [aeiou]{letter}*<br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 转换规则</h3>
<div class="outline-text-3" id="text-1-2">

<p>   转换规则形如：pattern {action}，例如：<br/>
</p>


<pre class="example">{fuword}      {printf ("%s%s",yytext, "ay");}
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 开始状态(start sate)</h2>
<div class="outline-text-2" id="text-2">

<p>  默认总有一个名为 <code>INITIAL</code> 的开始状态。<br/>
  开始状态有两种， <code>%x</code> 声明的exclusive和 <code>%s</code> 声明的inclusive开始状态. <br/>
  声明区声明一个开始状态，当使用 <code>BEGIN</code> 宏进入到某开始状态后，若是%x声明的开始状态则只有此开始状态之后的模式才会进行匹配，而%s声明的开始状态则既匹配此开始状态之后的模式也匹配其它的。<br/>
</p>


<pre class="example">%x XXX
%%
/\*                     BEGIN(COMMENT)
&lt;COMMENT&gt;\*/            BEGIN(INITIAL)
&lt;COMMENT&gt;([^*]|\n)+|.
&lt;COMMENT&gt;&lt;&lt;EOF&gt;&gt;        {printf("error"); return 0;}
[a-z]                   ECHO;
%%
</pre>

<p>
  上面代码用来忽略C源码中的注释。<br/>
  扫描遇到 <code>/*</code> 时执行 <code>BEGIN COMMENT</code> 进入到COMMENT开始状态，由于COMMENT由%x声明，所以之后只执行&lt;COMMENT&gt;之后的模式，当遇到 <code>*/</code> 时便返回到原来的INITIAL开始状态，对于/*和*/之间的字符不进行处理，如果在文件结束前没有遇到*/则输入错误信息。<br/>
</p>
<p>
  模式前的开始状态可以有多个： <code>&lt;INITIAL, STRING&gt;pattern {actions}</code>。<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="target">EOF</span></h2>
<div class="outline-text-2" id="text-3">

<p>  End Of File，此时 <code>yywrap</code> 返回非0值（表没有其它文件处理）。<br/>
  之后必须进行以下几件事之一：<br/>
</p><ol>
<li>调用 <code>yyterminate()</code> 结束。<br/>
</li>
<li>将 <code>yyin</code> 指向新的FILE。<br/>
</li>
<li>执行一个return语句。<br/>
</li>
<li>调用 <code>yy_switch_to_buffer</code> 切换到一个新的buffer。<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 输入管理</h2>
<div class="outline-text-2" id="text-4">

<p>  flex有一个结构体 <code>struct yy_buffer_state</code> 可用来管理输入， <code>YY_BUFFER_STATE</code> 是其指针类型（应该是宏定义 #define struct yy_buffer_state* YY_BUFFER_STATE）。<br/>
  为提高处理速度，可以先将待扫描内容预存到某指定buffer中，然后从此buffer中读取处理。<br/>
  <code>YY_BUFFER_SIZE</code> 为默认buffer大小（一般为16k）。<br/>
  <code>YY_BUFFER_STATE yy_create_buffer(FILE* file, int size)</code> 创建大小为size的buffer并与文件指针file相关联，返回 <code>YY_BUFFER_STATE</code>。 <code>yy_new_buffer</code> 是其c++版本（调用new/delete）。<br/>
  需扫描的文件可能不止一个，有时需要在几个文件中切换， <code>void yy_switch_to_buffer(YY_BUFFER_STATE new_buffer)</code> 可以实现此功能。<br/>
  <code>void yypush_buffer_state(YY_BUFFER_STATE buffer)</code> 将当前的 buffer 压栈，栈顶为状态为最新的状态，同理 <code>void yypop_buffer_state()</code> 弹出栈顶状态并调用 <code>yy_delete_buffer</code> 删除之，此时栈顶上的状态为最新的状态。(此两个函数有缺陷：不能保存环境相关的内容，例如变量等。不过可以通过自己实现类似的函数)<br/>
  <code>void yy_delete_buffer(YY_BUFFER_STATE buffer)</code> 来回收buffer指向的空间。<br/>
  <code>YY_CURRENT_BUFFER</code> 用来返回当前正在使用的 <code>YY_BUFFER_STATE</code> 。<br/>
  <code>YY_BUFFER_STATE yy_scan_buffer(char* base, yy_size_t size)</code> 扫描指定位置base开始的大小size的buffer。<br/>
  下面是来自flex手册的例子（Multiple Input Buffers）：<br/>
</p>


<pre class="src src-c">%x incl
%%
include         BEGIN(incl);
[a-z]+          ECHO;
[^a-z\n]*\n?    ECHO;
&lt;incl&gt;[ \t]*            <span style="color: #b22222;">/* </span><span style="color: #b22222;">eat the whitespace </span><span style="color: #b22222;">*/</span>
&lt;incl&gt;[^ \t\n]+         { <span style="color: #b22222;">/* </span><span style="color: #b22222;">got the include file name </span><span style="color: #b22222;">*/</span>
                        yyin = fopen( yytext, <span style="color: #8b2252;">"r"</span> );
                        <span style="color: #a020f0;">if</span> ( ! yyin )
                             error( ... );
                        yypush_buffer_state(yy_create_buffer( yyin, YY_BUF_SIZE ));
                        BEGIN(INITIAL);
                        }
&lt;&lt;EOF&gt;&gt;                 {
                        yypop_buffer_state();
                        <span style="color: #a020f0;">if</span> ( !YY_CURRENT_BUFFER ) {yyterminate();}
                        }
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> option</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> nodefault</h3>
<div class="outline-text-3" id="text-5-1">

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> yylineo</h3>
<div class="outline-text-3" id="text-5-2">

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> noyywrap</h3>
<div class="outline-text-3" id="text-5-3">

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> case-insensitive</h3>
<div class="outline-text-3" id="text-5-4">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 内置变量和函数</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 变量</h3>
<div class="outline-text-3" id="text-6-1">


</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> yytext</h4>
<div class="outline-text-4" id="text-6-1-1">

<p>    char* yytext  当前匹配的字符串<br/>
</p></div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> yyleng</h4>
<div class="outline-text-4" id="text-6-1-2">

<p>    int yyleng 当前匹配的字符串长度<br/>
</p></div>

</div>

<div id="outline-container-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> yyin</h4>
<div class="outline-text-4" id="text-6-1-3">

<p>    FILE* yyin  lex当前的解析文件，默认为标准输入<br/>
</p>


<pre class="example">如果命令行参数指定读取来源则打开该文件将FILE指针传递给yyin，否则为标准输入：
int main(int argc, char *argv[])
{
    if (argc&gt;1)
        yyin = fopen(argv[1], "r");
    else
        yyin = stdin;
    yylex();
    return 0;
}
</pre>

</div>

</div>

<div id="outline-container-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> yyout</h4>
<div class="outline-text-4" id="text-6-1-4">

<p>    FILE* yyout  lex解析后的输出文件，默认为标准输出<br/>
</p></div>

</div>

<div id="outline-container-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> yylineo</h4>
<div class="outline-text-4" id="text-6-1-5">

<p>    int yylineno     当前的行数信息<br/>
</p></div>

</div>

<div id="outline-container-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> ECHO</h4>
<div class="outline-text-4" id="text-6-1-6">

<p>    <code>#define ECHO fwrite(yytext, yyleng, 1, yyout)</code>  也是未匹配字符的默认动作<br/>
</p></div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 函数</h3>
<div class="outline-text-3" id="text-6-2">


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> yylex</h4>
<div class="outline-text-4" id="text-6-2-1">

<p>    int yylex(void)<br/>
    调用Lex进行词法分析，每次返回一个token.<br/>
</p></div>

</div>

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> yywrap</h4>
<div class="outline-text-4" id="text-6-2-2">




<pre class="example">int yywrap(void)   在文件(或输入)的末尾调用。如果函数的返回值是1，就停止解
                   析。 因此它可以用来解析多个文件。代码可以写在第三段，这
                   样可以解析多个文件。 方法是使用 yyin 文件指针指向不同的
                   文件，直到所有的文件都被解析。最后，yywrap() 可以返回1
                   来表示解析的结束。
</pre>

</div>

</div>

<div id="outline-container-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> yymore</h4>
<div class="outline-text-4" id="text-6-2-3">

<p>   yymore()           告诉扫描器下次扫描结果连接在当前yytext后而非覆盖当前yytext<br/>
</p>


<pre class="example"> \"[^"]*        {
                if (yytext[yyleng-1] == '\\')
                        yymore();
                else
                        ... normal user processing
                }
对于"abc\"def"情况，第一次扫描得yytex为abc\，判断最后一个字符为\后调用yymore()，则继续扫描得"def并将结果连接到上次结果中得：abc\"def
</pre>

</div>

</div>

<div id="outline-container-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> yyless</h4>
<div class="outline-text-4" id="text-6-2-4">

<p>    yyless()     回退字符，例如 yyless(yyleng-1)将最后一个字符回退，yyless(yyleng-2)回退两个字符。<br/>
</p></div>

</div>

<div id="outline-container-6-2-5" class="outline-4">
<h4 id="sec-6-2-5"><span class="section-number-4">6.2.5</span> yyrestart</h4>
<div class="outline-text-4" id="text-6-2-5">

<p>    <code>void yyresart(FILE* new_file)</code><br/>
    常见情况：将yyin指向新的文件，然后调用 yyrestart(yyin)，此时会丢弃之前进行的扫描，重新开始对新文件进行扫描。<br/>
    如果不对yyin赋新值，直接 yyrestart(yyin) 则会丢弃对现在文件的扫描重新扫描同一个文件。<br/>
</p></div>

</div>

<div id="outline-container-6-2-6" class="outline-4">
<h4 id="sec-6-2-6"><span class="section-number-4">6.2.6</span> REJECT</h4>
<div class="outline-text-4" id="text-6-2-6">

<p>   REJECT使用后会进行次好匹配，<br/>
</p>


<pre class="example">%{
#include &lt;stdio.h&gt;
%}

%%
a[bc]+  {printf("%s:%s\n","first rule", yytext); REJECT;}
a[cd]+  {printf ("%s:%s\n","second rule", yytext); REJECT;}
%%
</pre>

<p>
   对于accb,输出：<br/>
</p>


<pre class="example">first rule:accb
first rule:acc
second rule:acc
first rule:ac
second rule:ac
accb
</pre>

<p>
   第1次由a[bc]+匹配到accb，最长，故匹配成功；之后进行次好匹配，a[bc]+匹配到acc，a[cd]+匹配到acc，长度一样，故按照顺序输出，之后a[cb]+又匹配到ac，最后a[cd]+匹配ac，由于它是REJECT的故还想再重新开始匹配，由于没有再匹配的了，所以accb采用默认动作：ECHO－输出。<br/>
</p>
<p>
   将第2个printf中的REJECT删除后：<br/>
</p>


<pre class="example">first rule:accb
first rule:acc
second rule:acc
b
</pre>

<p>
   与上面一样，最后a[cd]+匹配到acc之后由于没有REJECT，forward指针指向b，b没有匹配，默认输出，<br/>
</p></div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 编译</h2>
<div class="outline-text-2" id="text-7">

<p>  lex文件以l结尾，lex test.l生成lex.yy.c，之后 cc lex.yy.c -ll生成a.out，再执行./a.out即可。<br/>
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 例子</h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>单词序列，如果一个单词第一个字母为元音则将它移动到单词尾并加上ay，否则只在单词后加ay<br/>
</li>
</ul>




<pre class="example">compiler$ cat test.l
%{
    #include &lt;stdio.h&gt;
%}

letter          [a-zA-Z]
yuanword        [aeiou]{letter}*
fuword          [bcdfghjklmnpqrstvwxyz]{letter}*

%%

{yuanword}        {printf("%s%c%s",yytext+1, *yytext, "ay");}
{fuword}      {printf ("%s%s",yytext, "ay");}
%%

compiler$ cat test.c
int main main abc 
compiler$ lex test.l 
compiler$ cc lex.yy.c -o test -ll
compiler$ ./test &lt; test.c
ntiay mainay mainay bcaay 
</pre>

<ul>
<li>将C源程序中所有float关键字变成double<br/>
</li>
</ul>




<pre class="example">compiler$ cat test.l
/* 注意不能将 "a float b"中的float变成double */
/* 所有float声明变量特点是声明或定义，即以;或=紧跟在标识符之后 */
%{
#include &lt;stdio.h&gt;
%}
/* regular definitions */
letter          [a-zA-Z]
digit           [0-9]
id              {letter}({letter}|{digit})*
delim           [ \t]
%%
"float"/{delim}{id}{delim}*(";"|"=")     {printf("%s","double");}
%%

compiler$ cat test.c
int main(int argc, char *argv[])
{
    float i;
    float ii = 1.0;
    char *str = "float";
    char *str2 = "a float b";
    return 0;
}
compiler$ lex test.l
compiler$ cc lex.yy.c -o test -ll
compiler$ ./test &lt; test.c
int main(int argc, char *argv[])
{
    double i;
    double ii = 1.0;
    char *str = "float";
    char *str2 = "a float b";
    return 0;
}
</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

</body>
</html>
